In [16]:
import pandas as pd 
import numpy as np

In [ ]:
np.random.seed(0)
n = 500
df = pd.DataFrame({
    "Student ID": np.arange(1, n+1),
    "Name": np.random(['Amit', 'Asha', 'Ankit', 'Parul', 'Rahul'], size=n),
    "Course Name": np.random.choice(['B.Tech', 'M.Tech', 'MBA', 'BBA', 'PhD'], size=n),
    "Subjects": np.random.choice(['Math', 'Science', 'History', 'Art', 'Physical Education'], size=n),
    "Marks": np.random.randint(0, 101, size=n),
})
df

     Student ID   Name Course Name            Subjects  Marks
0             1  Rahul      M.Tech                 Art     40
1             2   Amit         MBA                Math     95
2             3  Parul         MBA             History     11
3             4  Parul         PhD  Physical Education     56
4             5  Parul         BBA             Science     63
..          ...    ...         ...                 ...    ...
495         496   Asha         PhD                Math     38
496         497  Parul         BBA             Science     49
497         498  Ankit      M.Tech             History      8
498         499  Rahul      M.Tech             Science     65
499         500   Asha         BBA             Science     66

[500 rows x 5 columns]

In [35]:

df['Marks'] = np.random.randint(0, 101, size=n)

In [27]:

total_marks = df['Marks'].sum()
df

     Student ID   Name Course Name            Subjects  Marks
0            18  Ankit         PhD             History     74
1            21  Parul      B.Tech                Math     38
2            21   Amit         PhD                 Art     68
3            57  Rahul         MBA                 Art     39
4            27  Ankit         MBA             History     79
..          ...    ...         ...                 ...    ...
495          44   Asha      M.Tech                 Art     98
496          40  Ankit         BBA             Science     59
497          30   Amit         MBA  Physical Education     89
498          33  Ankit      M.Tech             History     27
499          52   Asha         MBA             History     56

[500 rows x 5 columns]

In [34]:

percentage = (total_marks / (n * 100)) * 100
percentage

47.593999999999994

In [36]:
gpa = (percentage / 100) * 4
gpa

1.9037599999999997